#pragma once

#include "../secrets.hpp"
#include <vector>
#include <string>

// Токен бота
#define BOT_TOKEN __BOT_TOKEN__

// Форматирование сообщений 
#define MESSAGE_FORMAT "Markdown"

// Ссылка на правила группы
#define RULES_GROUP_LINK "https://telegra.ph/Pravila-gruppy-RoboCOD-01-24"

// Имя файла для логирования
#define LOGS_FILE_NAME "RoboCodNetBot.log"

// Имя файла для базы данных
#define DB_FILE_NAME "RoboCodNetBot.db"

// Время на которое будет закреплён квиз
#define TIME_PIN_QUIZ 43200 // 12 часов

// Время на которое будет закреплёна задача
#define TIME_PIN_TASK 43200 // 12 часов

// ===== ОГРАНИЧЕНИЯ =====

// Время хранения кеша об статусе пользователя (является ли админом)
#define TIME_CACHE_IS_ADMIN 3600 // 1 час

// Максимальное количество сообщений в минуту
#define LIMIT_MESSAGES_IN_MINUTE 10

// ===== НАКАЗАНИЯ =====

// Время мута при /mute
#define MUTE_TIME_DEFAULT 300 // 5 минут

// Запрет отправлять сообщения за Ban Words
#define MUTE_TIME_BAN_WORDS 300 // 5 минут

// Запрет отправлять сообщения за Спам
#define MUTE_TIME_SPAM 600 // 10 минут

// Список запрещённых слов 
inline const std::vector<std::string> BAN_WORDS {
    // --- РУССКИЙ ---
    "сука", "суки", "суку", "сукой", "суке",
    "блять", "блядь", "бляди", "блядей", "блядям",
    "пидор", "пидорас", "пидорасы", "пидорасов", "пидоры", "пидр",
    "хуй", "нахуй", "похуй", "нахуя", "хуя", "хую", "хуем", "хуе", "хуи", "хуев",
    "негр", "негру", "негром", "негры", "нигер", "ниггер", "нигеры",
    "захар", "вконтакте", "вк", "вконтакт",

    "ебать", "ебал", "ебала", "ебали", "ебло", "еблет", 
    "еблан", "ебланы", "ебанат", "ебанутый", 
    "долбоеб", "долбоёб", "долбоебы", "уебок", "уебан", 
    "заебал", "заебала", "выебоны",
    
    "пизда", "пизды", "пизде", "пизду", "пиздой", 
    "пиздец", "пиздатый", "пиздеть", "спиздил", "пиздюк", "пиздюлей",

    "хуесос", "хуесосы", "хуйло", "хуйня", "хуйню", "хуйне", 
    "охуел", "охуели", "ахуел", "хуевый",

    "мудак", "мудаки", "мудака", "мудило", "мудила",
    "гандон", "гондон", "гандоны", "гондоны",
    "шлюха", "шлюхи", "шлюх", "шлюхе",
    "манда", "манды",
    "залупа", "залупу",
    "чмо", "чмырь", "чмошник",
    "говно", "гавно",
    "педик", "педики", 
    "даун", "дауны", "аутист",

    // --- ENGLISH ---
    "fuck", "fucking", "fucker", "fucked", "motherfucker", "fuckhead",
    
    "nigger", "nigga", "niggaz", "niggers", "neger", 
    
    "cunt", "cunts",
    "pussy", "pussies",
    "dick", "dicks", "cocksucker", "cock",
    "bitch", "bitches", "bitching",
    "whore", "whores", "slut", "sluts",
    "asshole", "assholes", "arsehole",
    "bastard", "bastards",
    "shit", "bullshit", "shitty",
    
    "faggot", "fag", "fags",
    "retard", "retarded",
    "tranny",

    "rules34"
};